[
  {
    "source": "The Hacker News",
    "title": "Docker Fixes Critical Ask Gordon AI Flaw Allowing Code Execution via Image Metadata",
    "link": "https://thehackernews.com/2026/02/docker-fixes-critical-ask-gordon-ai.html",
    "published": "Tue, 03 Feb 2026 22:11:00 +0530",
    "summary": "Cybersecurity researchers have disclosed details of a now-patched security flaw impacting Ask Gordon, an artificial intelligence (AI) assistant built into Docker Desktop and the Docker Command-Line Interface (CLI), that could be exploited to execute code and exfiltrate sensitive data.\nThe critical vulnerability has been codenamed DockerDash by cybersecurity company Noma Labs. It was addressed by",
    "analysis": {
      "issue": "Docker patched a critical Ask Gordon AI flaw enabling code execution and data theft via malicious image metadata in version 4",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "[Webinar] The Smarter SOC Blueprint: Learn What to Build, Buy, and Automate",
    "link": "https://thehackernews.com/2026/02/webinar-smarter-soc-blueprint-learn.html",
    "published": "Tue, 03 Feb 2026 19:44:00 +0530",
    "summary": "Most security teams today are buried under tools. Too many dashboards. Too much noise. Not enough real progress.\nEvery vendor promises “complete coverage” or “AI-powered automation,” but inside most SOCs, teams are still overwhelmed, stretched thin, and unsure which tools are truly pulling their weight. The result? Bloated stacks, missed signals, and mounting pressure to do more with less.\nThis",
    "analysis": {
      "issue": "Live webinar explains how modern SOCs decide what to build, buy, or automate to reduce tool sprawl and improve outcomes",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "Hackers Exploit Metro4Shell RCE Flaw in React Native CLI npm Package",
    "link": "https://thehackernews.com/2026/02/hackers-exploit-metro4shell-rce-flaw-in.html",
    "published": "Tue, 03 Feb 2026 19:30:00 +0530",
    "summary": "Threat actors have been observed exploiting a critical security flaw impacting the Metro Development Server in the popular \"@react-native-community/cli\" npm package.\nCybersecurity company VulnCheck said it first observed exploitation of CVE-2025-11953 (aka Metro4Shell) on December 21, 2025. With a CVSS score of 9.8, the vulnerability allows remote unauthenticated attackers to execute arbitrary",
    "analysis": {
      "issue": "Active attacks exploit Metro4Shell (CVE-2025-11953) in React Native CLI to execute commands and deploy Rust malware",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [
        "CVE-2025-11953"
      ],
      "threat_categories": [
        "Vulnerability",
        "Malware"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "When Cloud Outages Ripple Across the Internet",
    "link": "https://thehackernews.com/2026/02/when-cloud-outages-ripple-across.html",
    "published": "Tue, 03 Feb 2026 16:30:00 +0530",
    "summary": "Recent major cloud service outages have been hard to miss. High-profile incidents affecting providers such as AWS, Azure, and Cloudflare have disrupted large parts of the internet, taking down websites and services that many other systems depend on. The resulting ripple effects have halted applications and workflows that many organizations rely on every day.\nFor consumers, these outages are",
    "analysis": {
      "issue": "Cloud outages expose identity systems as critical failure points, turning infrastructure disruptions into major business continuity risks",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "APT28 Uses Microsoft Office CVE-2026-21509 in Espionage-Focused Malware Attacks",
    "link": "https://thehackernews.com/2026/02/apt28-uses-microsoft-office-cve-2026.html",
    "published": "Tue, 03 Feb 2026 14:42:00 +0530",
    "summary": "The Russia-linked state-sponsored threat actor known as APT28 (aka UAC-0001) has been attributed to attacks exploiting a newly disclosed security flaw in Microsoft Office as part of a campaign codenamed Operation Neusploit.\nZscaler ThreatLabz said it observed the hacking group weaponizing the shortcoming on January 29, 2026, in attacks targeting users in Ukraine, Slovakia, and Romania, three",
    "analysis": {
      "issue": "APT28 exploited a Microsoft Office flaw to deliver MiniDoor and Covenant Grunt malware in targeted attacks across Ukraine and Eastern Europe",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [
        "CVE-2026-21509"
      ],
      "threat_categories": [
        "Vulnerability",
        "Malware",
        "APT"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "Mozilla Adds One-Click Option to Disable Generative AI Features in Firefox",
    "link": "https://thehackernews.com/2026/02/mozilla-adds-one-click-option-to.html",
    "published": "Tue, 03 Feb 2026 11:09:00 +0530",
    "summary": "Mozilla on Monday announced a new controls section in its Firefox desktop browser settings that allows users to completely turn off generative artificial intelligence (GenAI) features.\n\"It provides a single place to block current and future generative AI features in Firefox,\" Ajit Varma, head of Firefox, said. \"You can also review and manage individual AI features if you choose to use them. This",
    "analysis": {
      "issue": "Mozilla will release Firefox 148 with a new settings toggle that lets users completely turn off all current and future generative AI features",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "Notepad++ Hosting Breach Attributed to China-Linked Lotus Blossom Hacking Group",
    "link": "https://thehackernews.com/2026/02/notepad-hosting-breach-attributed-to.html",
    "published": "Tue, 03 Feb 2026 10:25:00 +0530",
    "summary": "A China-linked threat actor known as Lotus Blossom has been attributed with medium confidence to the recently discovered compromise of the infrastructure hosting Notepad++.\nThe attack enabled the state-sponsored hacking group to deliver a previously undocumented backdoor codenamed Chrysalis to users of the open-source editor, according to new findings from Rapid7.\nThe development comes shortly",
    "analysis": {
      "issue": "Rapid7 links China-linked Lotus Blossom to a 2025 Notepad++ hosting breach that delivered the Chrysalis backdoor via hijacked updates, fixed in v8",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Malware"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "Researchers Find 341 Malicious ClawHub Skills Stealing Data from OpenClaw Users",
    "link": "https://thehackernews.com/2026/02/researchers-find-341-malicious-clawhub.html",
    "published": "Mon, 02 Feb 2026 23:19:00 +0530",
    "summary": "A security audit of 2,857 skills on ClawHub has found 341 malicious skills across multiple campaigns, according to new findings from Koi Security, exposing users to new supply chain risks.\nClawHub is a marketplace designed to make it easy for OpenClaw users to find and install third-party skills. It's an extension to the OpenClaw project, a self-hosted artificial intelligence (AI) assistant",
    "analysis": {
      "issue": "A security audit found 341 malicious ClawHub skills abusing OpenClaw to spread Atomic Stealer and steal credentials on macOS and Windows",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "OpenClaw Bug Enables One-Click Remote Code Execution via Malicious Link",
    "link": "https://thehackernews.com/2026/02/openclaw-bug-enables-one-click-remote.html",
    "published": "Mon, 02 Feb 2026 21:58:00 +0530",
    "summary": "A high-severity security flaw has been disclosed in OpenClaw (formerly referred to as Clawdbot and Moltbot) that could allow remote code execution (RCE) through a crafted malicious link.\nThe issue, which is tracked as CVE-2026-25253 (CVSS score: 8.8), has been addressed in version 2026.1.29 released on January 30, 2026. It has been described as a token exfiltration vulnerability that leads to",
    "analysis": {
      "issue": "A high-severity OpenClaw flaw allows one-click remote code execution via token theft and WebSocket hijacking; patched in v2026",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "High",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "The Hacker News",
    "title": "Microsoft Begins NTLM Phase-Out With Three-Stage Plan to Move Windows to Kerberos",
    "link": "https://thehackernews.com/2026/02/microsoft-begins-ntlm-phase-out-with.html",
    "published": "Mon, 02 Feb 2026 21:29:00 +0530",
    "summary": "Microsoft has announced a three-phase approach to phase out New Technology LAN Manager (NTLM) as part of its efforts to shift Windows environments toward stronger, Kerberos-based options.\nThe development comes more than two years after the tech giant revealed its plans to deprecate the legacy technology, citing its susceptibility to weaknesses that could facilitate relay attacks and allow bad",
    "analysis": {
      "issue": "Microsoft confirms a 3-phase strategy to deprecate NTLM, improve auditing, prioritize Kerberos, and disable NTLM by default in future Windows releases",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Krebs On Security",
    "title": "Kimwolf Botnet Lurking in Corporate, Govt. Networks",
    "link": "https://krebsonsecurity.com/2026/01/kimwolf-botnet-lurking-in-corporate-govt-networks/",
    "published": "Tue, 20 Jan 2026 18:19:13 +0000",
    "summary": "A new Internet-of-Things botnet called Kimwolf has spread to more than 2 million devices, forcing infected systems to participate in massive distributed denial-of-service (DDoS) attacks and to relay other malicious and abusive Internet traffic. Kimwolf's ability to scan the local networks of compromised systems for other IoT devices to infect makes it a sobering threat to organizations, and new research reveals Kimwolf is surprisingly prevalent in government and corporate networks."
  },
  {
    "source": "Krebs On Security",
    "title": "Patch Tuesday, January 2026 Edition",
    "link": "https://krebsonsecurity.com/2026/01/patch-tuesday-january-2026-edition/",
    "published": "Wed, 14 Jan 2026 00:47:38 +0000",
    "summary": "Microsoft today issued patches to plug at least 113 security holes in its various Windows operating systems and supported software. Eight of the vulnerabilities earned Microsoft's most-dire \"critical\" rating, and the company warns that attackers are already exploiting one of the bugs fixed today."
  },
  {
    "source": "Krebs On Security",
    "title": "Who Benefited from the Aisuru and Kimwolf Botnets?",
    "link": "https://krebsonsecurity.com/2026/01/who-benefited-from-the-aisuru-and-kimwolf-botnets/",
    "published": "Thu, 08 Jan 2026 23:23:43 +0000",
    "summary": "Our first story of 2026 revealed how a destructive new botnet called Kimwolf rapidly grew to infect more than two million devices by mass-compromising a vast number of unofficial Android TV streaming boxes. Today, we'll dig through digital clues left behind by the hackers, network operators, and cybercrime services that appear to have benefitted from Kimwolf's spread."
  },
  {
    "source": "Krebs On Security",
    "title": "The Kimwolf Botnet is Stalking Your Local Network",
    "link": "https://krebsonsecurity.com/2026/01/the-kimwolf-botnet-is-stalking-your-local-network/",
    "published": "Fri, 02 Jan 2026 14:20:10 +0000",
    "summary": "The story you are reading is a series of scoops nestled inside a far more urgent Internet-wide security advisory. The vulnerability at issue has been exploited for months already, and it's time for a broader awareness of the threat. The short version is that everything you thought you knew about the security of the internal network behind your Internet router probably is now dangerously out of date."
  },
  {
    "source": "Krebs On Security",
    "title": "Happy 16th Birthday, KrebsOnSecurity.com!",
    "link": "https://krebsonsecurity.com/2025/12/happy-16th-birthday-krebsonsecurity-com/",
    "published": "Mon, 29 Dec 2025 20:23:26 +0000",
    "summary": "KrebsOnSecurity.com celebrates its 16th anniversary today! A huge \"thank you\" to all of our readers -- newcomers, long-timers and drive-by critics alike. Your engagement this past year here has been tremendous and truly a salve on a handful of dark days. Happily, comeuppance was a strong theme running through our coverage in 2025, with a primary focus on entities that enabled complex and globally-dispersed cybercrime services."
  },
  {
    "source": "Krebs On Security",
    "title": "Dismantling Defenses: Trump 2.0 Cyber Year in Review",
    "link": "https://krebsonsecurity.com/2025/12/dismantling-defenses-trump-2-0-cyber-year-in-review/",
    "published": "Fri, 19 Dec 2025 15:14:55 +0000",
    "summary": "The Trump administration has pursued a staggering range of policy pivots this past year that threaten to weaken the nation’s ability and willingness to address a broad spectrum of technology challenges, from cybersecurity and privacy to countering disinformation, fraud and corruption. These shifts, along with the president’s efforts to restrict free speech and freedom of the press, have come at such a rapid clip that many readers probably aren’t even aware of them all."
  },
  {
    "source": "Krebs On Security",
    "title": "Most Parked Domains Now Serving Malicious Content",
    "link": "https://krebsonsecurity.com/2025/12/most-parked-domains-now-serving-malicious-content/",
    "published": "Tue, 16 Dec 2025 14:14:48 +0000",
    "summary": "Direct navigation -- the act of visiting a website by manually typing a domain name in a web browser -- has never been riskier: A new study finds the vast majority of \"parked\" domains -- mostly expired or dormant domain names, or common misspellings of popular websites -- are now configured to redirect visitors to sites that foist scams and malware."
  },
  {
    "source": "Krebs On Security",
    "title": "Microsoft Patch Tuesday, December 2025 Edition",
    "link": "https://krebsonsecurity.com/2025/12/microsoft-patch-tuesday-december-2025-edition/",
    "published": "Tue, 09 Dec 2025 23:18:29 +0000",
    "summary": "Microsoft today pushed updates to fix at least 56 security flaws in its Windows operating systems and supported software. This final Patch Tuesday of 2025 tackles one zero-day bug that is already being exploited, as well as two publicly disclosed vulnerabilities."
  },
  {
    "source": "Krebs On Security",
    "title": "Drones to Diplomas: How Russia’s Largest Private University is Linked to a $25M Essay Mill",
    "link": "https://krebsonsecurity.com/2025/12/drones-to-diplomas-how-russias-largest-private-university-is-linked-to-a-25m-essay-mill/",
    "published": "Sat, 06 Dec 2025 14:45:03 +0000",
    "summary": "A sprawling academic cheating network turbocharged by Google Ads that has generated nearly $25 million in revenue has curious connections to a Kremlin-connected oligarch whose Russian university builds drones for Russia's war against Ukraine."
  },
  {
    "source": "Krebs On Security",
    "title": "SMS Phishers Pivot to Points, Taxes, Fake Retailers",
    "link": "https://krebsonsecurity.com/2025/12/sms-phishers-pivot-to-points-taxes-fake-retailers/",
    "published": "Thu, 04 Dec 2025 23:02:34 +0000",
    "summary": "China-based phishing groups blamed for non-stop scam SMS messages about a supposed wayward package or unpaid toll fee are promoting a new offering, just in time for the holiday shopping season: Phishing kits for mass-creating fake but convincing e-commerce websites that convert customer payment card data into mobile wallets from Apple and Google. Experts say these same phishing groups also are now using SMS lures that promise unclaimed tax refunds and mobile rewards points."
  },
  {
    "source": "Security Week",
    "title": "RADICL Raises $31 Million for vSOC",
    "link": "https://www.securityweek.com/radicl-raises-31-million-for-vsoc/",
    "published": "Tue, 03 Feb 2026 15:32:00 +0000",
    "summary": "<p>The company will use the investment to accelerate development of its autonomous virtual security operations center (vSOC).</p>\n<p>The post <a href=\"https://www.securityweek.com/radicl-raises-31-million-for-vsoc/\">RADICL Raises $31 Million for vSOC</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "RapidFort Raises $42M to Automate Software Supply Chain Security",
    "link": "https://www.securityweek.com/rapidfort-raises-42m-to-automate-software-supply-chain-security/",
    "published": "Tue, 03 Feb 2026 14:41:18 +0000",
    "summary": "<p>The company will use the latest capital to scale its go-to-market efforts and expand its platform’s capabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/rapidfort-raises-42m-to-automate-software-supply-chain-security/\">RapidFort Raises $42M to Automate Software Supply Chain Security</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "Critical React Native Vulnerability Exploited in the Wild",
    "link": "https://www.securityweek.com/critical-react-native-vulnerability-exploited-in-the-wild/",
    "published": "Tue, 03 Feb 2026 14:00:00 +0000",
    "summary": "<p>Albeit mainly considered a theoretical risk, the flaw has been exploited to disable protections and deliver malware.</p>\n<p>The post <a href=\"https://www.securityweek.com/critical-react-native-vulnerability-exploited-in-the-wild/\">Critical React Native Vulnerability Exploited in the Wild</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "Vulnerability Allows Hackers to Hijack OpenClaw AI Assistant",
    "link": "https://www.securityweek.com/vulnerability-allows-hackers-to-hijack-openclaw-ai-assistant/",
    "published": "Tue, 03 Feb 2026 13:44:55 +0000",
    "summary": "<p>OpenClaw (aka Moltbot and Clawdbot) is vulnerable to one-click remote code execution attacks.</p>\n<p>The post <a href=\"https://www.securityweek.com/vulnerability-allows-hackers-to-hijack-openclaw-ai-assistant/\">Vulnerability Allows Hackers to Hijack OpenClaw AI Assistant </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "Hackers Leak 5.1 Million Panera Bread Records",
    "link": "https://www.securityweek.com/hackers-leak-5-1-million-panera-bread-accounts/",
    "published": "Tue, 03 Feb 2026 12:16:31 +0000",
    "summary": "<p>ShinyHunters has claimed the theft of 14 million records from the US bakery-cafe chain’s systems.</p>\n<p>The post <a href=\"https://www.securityweek.com/hackers-leak-5-1-million-panera-bread-accounts/\">Hackers Leak 5.1 Million Panera Bread Records</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "Russia’s APT28 Rapidly Weaponizes Newly Patched Office Vulnerability",
    "link": "https://www.securityweek.com/russias-apt28-rapidly-weaponizes-newly-patched-office-vulnerability/",
    "published": "Tue, 03 Feb 2026 11:22:52 +0000",
    "summary": "<p>The attacks targeting Europe were analyzed by Ukraine’s CERT-UA and the cybersecurity company Zscaler.</p>\n<p>The post <a href=\"https://www.securityweek.com/russias-apt28-rapidly-weaponizes-newly-patched-office-vulnerability/\">Russia&#8217;s APT28 Rapidly Weaponizes Newly Patched Office Vulnerability </a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "Kasada Raises $20 Million for Anti-Bot Expansion",
    "link": "https://www.securityweek.com/kasada-raises-20-million-for-anti-bot-expansion/",
    "published": "Tue, 03 Feb 2026 11:00:00 +0000",
    "summary": "<p>The company will invest in market expansion and accelerating product capabilities.</p>\n<p>The post <a href=\"https://www.securityweek.com/kasada-raises-20-million-for-anti-bot-expansion/\">Kasada Raises $20 Million for Anti-Bot Expansion</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "ShinyHunters-Branded Extortion Activity Expands, Escalates",
    "link": "https://www.securityweek.com/shinyhunters-branded-extortion-activity-expands-escalates/",
    "published": "Mon, 02 Feb 2026 15:28:16 +0000",
    "summary": "<p>Hackers rely on evolved vishing and login harvesting to compromise SSO credentials for unauthorized MFA enrollment.</p>\n<p>The post <a href=\"https://www.securityweek.com/shinyhunters-branded-extortion-activity-expands-escalates/\">ShinyHunters-Branded Extortion Activity Expands, Escalates</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "Open VSX Publisher Account Hijacked in Fresh GlassWorm Attack",
    "link": "https://www.securityweek.com/open-vsx-publisher-account-hijacked-in-fresh-glassworm-attack/",
    "published": "Mon, 02 Feb 2026 14:12:50 +0000",
    "summary": "<p>A hacker published malicious versions of four established VS Code extensions to distribute a GlassWorm malware loader.</p>\n<p>The post <a href=\"https://www.securityweek.com/open-vsx-publisher-account-hijacked-in-fresh-glassworm-attack/\">Open VSX Publisher Account Hijacked in Fresh GlassWorm Attack</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Security Week",
    "title": "Default ICS Credentials Exploited in Destructive Attack on Polish Energy Facilities",
    "link": "https://www.securityweek.com/default-ics-credentials-exploited-in-destructive-attack-on-polish-energy-facilities/",
    "published": "Mon, 02 Feb 2026 13:50:53 +0000",
    "summary": "<p>Poland’s CERT has published a report on the recent attack, providing new details on targeted ICS and attribution.</p>\n<p>The post <a href=\"https://www.securityweek.com/default-ics-credentials-exploited-in-destructive-attack-on-polish-energy-facilities/\">Default ICS Credentials Exploited in Destructive Attack on Polish Energy Facilities</a> appeared first on <a href=\"https://www.securityweek.com\">SecurityWeek</a>.</p>"
  },
  {
    "source": "Talos Blog",
    "title": "I'm locked in!",
    "link": "https://blog.talosintelligence.com/im-locked-in/",
    "published": "Thu, 29 Jan 2026 19:00:34 GMT",
    "summary": "Hazel reflects on how to find balance while staying informed, then delivers practical updates and insights on the latest cybersecurity threats.",
    "analysis": {
      "issue": "Welcome to this week’s edition of the Threat Source newsletter",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "Microsoft releases update to address zero-day vulnerability in Microsoft Office",
    "link": "https://blog.talosintelligence.com/microsoft-oob-update-january-2026/",
    "published": "Thu, 29 Jan 2026 14:43:54 GMT",
    "summary": "Microsoft has published three out-of-band (OOB) updates so far in January 2026. One of these updates was released to address a vulnerability, CVE-2026-21509, affecting Microsoft Office that has been reportedly exploited in the wild.",
    "analysis": {
      "issue": "CVE-2026-21509 was published to address a security feature bypass vulnerability affecting Microsoft Office",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [
        "CVE-2026-21509"
      ],
      "threat_categories": [
        "Vulnerability"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "Dissecting UAT-8099: New persistence mechanisms and regional focus",
    "link": "https://blog.talosintelligence.com/uat-8099-new-persistence-mechanisms-and-regional-focus/",
    "published": "Thu, 29 Jan 2026 11:00:11 GMT",
    "summary": "Cisco Talos has identified a new, regionally targeted campaign by UAT-8099 that leverages advanced persistence techniques and custom BadIIS malware variants to compromise IIS servers, particularly in Thailand and Vietnam.",
    "analysis": {
      "issue": "Cisco Talos observed new activity from UAT-8099 spanning from August 2025 through early 2026",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "High",
      "cves": [],
      "threat_categories": [
        "Malware"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "IR Trends Q4 2025: Exploitation remains dominant, phishing campaign targets Native American tribal organizations",
    "link": "https://blog.talosintelligence.com/ir-trends-q4-2025/",
    "published": "Thu, 29 Jan 2026 11:00:07 GMT",
    "summary": "A drop in exploitation and ransomware, but a spike in phishing and credential abuse, show why timely patching and robust MFA matter more than ever.",
    "analysis": {
      "issue": "Threat actors predominately exploited public-facing applications for the second quarter in a row, with this tactic appearing in nearly 40 percent of Cisco Talos Incident Response (Talos IR) engagements — a notable decrease from over 60 percent last q",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "High",
      "cves": [
        "CVE-2025-55182",
        "CVE-2025-61882"
      ],
      "threat_categories": [
        "Ransomware",
        "Vulnerability",
        "Malware",
        "Phishing",
        "APT"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "I scan, you scan, we all scan for...  knowledge?",
    "link": "https://blog.talosintelligence.com/i-scan-you-scan-we-all-scan-for-knowledge/",
    "published": "Thu, 22 Jan 2026 19:00:11 GMT",
    "summary": "In this week's newsletter, Bill hammers home the old adage, \"Know your environment\" — even throughout alert fatigue.",
    "analysis": {
      "issue": "Welcome to this week’s edition of the Threat Source newsletter",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "Foxit, Epic Games Store, MedDreams vulnerabilities",
    "link": "https://blog.talosintelligence.com/foxi-and-epic-games/",
    "published": "Thu, 22 Jan 2026 13:54:57 GMT",
    "summary": "<p>Cisco Talos&#x2019; Vulnerability Discovery &amp; Research team recently disclosed three vulnerabilities in Foxit PDF Editor, one in the Epic Games Store, and twenty-one in MedDream PACS..</p><p>The vulnerabilities mentioned in this blog post have been patched by their respective vendors, all in adherence to<a href=\"https://sec.cloudapps.cisco.com/security/center/resources/vendor_vulnerability_policy.html\"> <u>Cisco&#x2019;s third-party vulnerability</u></a></p>",
    "analysis": {
      "issue": "Cisco Talos’ Vulnerability Discovery & Research team recently disclosed three vulnerabilities in Foxit PDF Editor, one in the Epic Games Store, and twenty-one in MedDream PACS",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [
        "CVE-2025-59488",
        "CVE-2025-58085",
        "CVE-2025-57779"
      ],
      "threat_categories": [
        "Vulnerability",
        "Supply Chain"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "Predicting 2026",
    "link": "https://blog.talosintelligence.com/predicting-2026/",
    "published": "Thu, 15 Jan 2026 19:00:15 GMT",
    "summary": "In this week’s newsletter, Martin examines the evolving landscape for 2026, highlighting key threats, emerging trends like AI-driven risks, and the continued importance of addressing familiar vulnerabilities.",
    "analysis": {
      "issue": "Welcome to this week’s edition of the Threat Source newsletter",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Data Breach",
        "Malware",
        "Phishing"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "UAT-8837 targets critical infrastructure sectors in North America",
    "link": "https://blog.talosintelligence.com/uat-8837/",
    "published": "Thu, 15 Jan 2026 11:00:47 GMT",
    "summary": "Cisco Talos is closely tracking UAT-8837, a threat actor we assess with medium confidence is a China-nexus advanced persistent threat (APT) actor.",
    "analysis": {
      "issue": "After obtaining initial access — either by successful exploitation of vulnerable servers or by using compromised credentials — UAT-8837 predominantly deploys open-source tools to harvest sensitive information such as credentials, security configurati",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [
        "CVE-2025-53690"
      ],
      "threat_categories": [
        "Vulnerability"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "Brushstrokes and breaches with Terryn Valikodath",
    "link": "https://blog.talosintelligence.com/brushstrokes-and-breaches-with-terryn-valikodath/",
    "published": "Wed, 14 Jan 2026 11:00:25 GMT",
    "summary": "Terryn’s path to cybersecurity started with a fascination for criminal forensics and a knack for jailbreaking his family's tech — interests that eventually steered him toward the fast-paced world of digital investigations.",
    "analysis": {
      "issue": "Cisco Talos is kicking off the new year with a behind-the-scenes look at incident response through the eyes of Terryn Valikodath, Senior Incident Response Consultant at Talos",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "High",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Talos Blog",
    "title": "Microsoft Patch Tuesday for January 2026 — Snort rules and prominent vulnerabilities",
    "link": "https://blog.talosintelligence.com/microsoft-patch-tuesday-january-2026/",
    "published": "Tue, 13 Jan 2026 18:29:13 GMT",
    "summary": "Microsoft has released its monthly security update for January 2026, which includes 112 vulnerabilities affecting a range of products, including 8 that Microsoft marked as “critical”.",
    "analysis": {
      "issue": "Microsoft has released its monthly security update for January 2026, which includes 112 vulnerabilities affecting a range of products, including 8 that Microsoft marked as “critical”",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [
        "CVE-2026-20854",
        "CVE-2026-20876",
        "CVE-2026-20952",
        "CVE-2026-20955",
        "CVE-2026-20944",
        "CVE-2026-20822",
        "CVE-2026-20953",
        "CVE-2026-20805"
      ],
      "threat_categories": [
        "Vulnerability"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "Autonomous Threat Operations in action: Real results from Recorded Future’s own SOC team | Recorded Future",
    "link": "https://www.recordedfuture.com/blog/autonomous-threat-operations-in-action",
    "published": "Sun, 01 Feb 2026 00:00:00 GMT",
    "summary": "This article explores how Recorded Future served as Customer Zero for Autonomous Threat Operations, testing the new solution within our own SOC to validate its real-world impact before releasing it to the public. The article reveals how the technology transformed inconsistent, analyst-dependent threat hunting into unified, automated operations—enabling junior analysts to run 15–20 hunts weekly and allowing our CISO to launch comprehensive network hunts in five minutes in response to critical threats like Salt Typhoon. By understanding these outcomes, security leaders can see how autonomous threat hunting empowers teams at every skill level to shift from reactive to proactive defense.",
    "analysis": {
      "issue": "This article explores how Recorded Future served as Customer Zero for Autonomous Threat Operations, testing the new solution within our own SOC to validate its real-world impact before releasing it to the public",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "PurpleBravo’s Targeting of the IT Software Supply Chain",
    "link": "https://www.recordedfuture.com/research/purplebravos-targeting-it-software-supply-chain",
    "published": "Wed, 21 Jan 2026 00:00:00 GMT",
    "summary": "Discover how PurpleBravo, a North Korean threat group, exploits fake job offers to target software supply chains, using RATs and infostealers like BeaverTail.",
    "analysis": {
      "issue": "Discover how PurpleBravo, a North Korean threat group, exploits fake job offers to target software supply chains, using RATs and infostealers like BeaverTail",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Vulnerability",
        "Supply Chain"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "Threat and Vulnerability Management in 2026",
    "link": "https://www.recordedfuture.com/blog/threat-and-vulnerability-management",
    "published": "Fri, 16 Jan 2026 00:00:00 GMT",
    "summary": "Understand the future of threat and vulnerability management (TVM). Learn what TVM is, why traditional tools fail, and how intelligence is essential in today’s landscape.",
    "analysis": {
      "issue": "Understand the future of threat and vulnerability management (TVM)",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Vulnerability"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "Best Ransomware Detection Tools",
    "link": "https://www.recordedfuture.com/blog/best-ransomware-detection-tools",
    "published": "Tue, 13 Jan 2026 00:00:00 GMT",
    "summary": "Stop ransomware before encryption begins. Learn how intelligence-driven detection tools can help identify precursor behaviors and reduce false positives for faster response.",
    "analysis": {
      "issue": "Stop ransomware before encryption begins",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Ransomware"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "December 2025 CVE Landscape: 22 Critical Vulnerabilities Mark 120% Surge, React2Shell Dominates Threat Activity",
    "link": "https://www.recordedfuture.com/blog/december-2025-cve-landscape",
    "published": "Tue, 13 Jan 2026 00:00:00 GMT",
    "summary": "December 2025 saw a 120% surge in critical CVEs, with 22 exploited flaws and React2Shell (CVE-2025-55182) dominating threat activity across Meta’s React framework.",
    "analysis": {
      "issue": "December 2025 saw a 120% surge in critical CVEs, with 22 exploited flaws and React2Shell (CVE-2025-55182) dominating threat activity across Meta’s React framework",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [
        "CVE-2025-55182"
      ],
      "threat_categories": [
        "Vulnerability"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "Practitioners Reveal What Makes Threat Intelligence Programs Mature",
    "link": "https://www.recordedfuture.com/blog/practitioner-insights-advancing-threat-intelligence",
    "published": "Fri, 09 Jan 2026 00:00:00 GMT",
    "summary": "Threat intelligence practitioners from Global Payments, Adobe, and Superhuman reveal how mature CTI programs transform data overload into strategic business value. Learn proven approaches to automation, cross-functional collaboration, and executive communication.",
    "analysis": {
      "issue": "Threat intelligence practitioners from Global Payments, Adobe, and Superhuman reveal how mature CTI programs transform data overload into strategic business value",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "GRU-Linked BlueDelta Evolves Credential Harvesting",
    "link": "https://www.recordedfuture.com/research/gru-linked-bluedelta-evolves-credential-harvesting",
    "published": "Wed, 07 Jan 2026 00:00:00 GMT",
    "summary": "Insikt Group reveals how GRU-linked BlueDelta evolved credential-harvesting campaigns targeting government, energy, and research organizations across Europe and Eurasia.",
    "analysis": {
      "issue": "Insikt Group reveals how GRU-linked BlueDelta evolved credential-harvesting campaigns targeting government, energy, and research organizations across Europe and Eurasia",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "New ransomware tactics to watch out for in 2026",
    "link": "https://www.recordedfuture.com/blog/ransomware-tactics-2026",
    "published": "Mon, 05 Jan 2026 00:00:00 GMT",
    "summary": "Ransomware groups made less money in 2025 despite a 47% increase in attacks, driving new tactics: bundled DDoS services, insider recruitment, and gig worker exploitation. Learn the emerging trends defenders must prepare for in 2026.",
    "analysis": {
      "issue": "Ransomware groups made less money in 2025 despite a 47% increase in attacks, driving new tactics: bundled DDoS services, insider recruitment, and gig worker exploitation",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Ransomware",
        "Vulnerability",
        "DDoS"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "Digital Threat Detection Tools & Best Practices",
    "link": "https://www.recordedfuture.com/blog/digital-threat-detection",
    "published": "Mon, 22 Dec 2025 00:00:00 GMT",
    "summary": "Explore digital threat detection tools and learn best practices to identify, analyze, and neutralize digital threats before they impact your business.",
    "analysis": {
      "issue": "Explore digital threat detection tools and learn best practices to identify, analyze, and neutralize digital threats before they impact your business",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Recorded Future",
    "title": "BlueDelta’s Persistent Campaign Against UKR.NET",
    "link": "https://www.recordedfuture.com/research/bluedeltas-persistent-campaign-against-ukrnet",
    "published": "Wed, 17 Dec 2025 00:00:00 GMT",
    "summary": "Discover how Russia’s BlueDelta targets UKR.NET users with advanced credential-harvesting campaigns, evolving tradecraft, and multi-stage phishing techniques.",
    "analysis": {
      "issue": "Discover how Russia’s BlueDelta targets UKR",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Phishing"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Student Loan Breach Exposes 2.5M Records",
    "link": "https://threatpost.com/student-loan-breach-exposes-2-5m-records/180492/",
    "published": "Wed, 31 Aug 2022 12:57:48 +0000",
    "summary": "2.5 million people were affected, in a breach that could spell more trouble down the line.",
    "analysis": {
      "issue": "5 million people were affected, in a breach that could spell more trouble down the line",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Data Breach",
        "Supply Chain"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Watering Hole Attacks Push ScanBox Keylogger",
    "link": "https://threatpost.com/watering-hole-attacks-push-scanbox-keylogger/180490/",
    "published": "Tue, 30 Aug 2022 16:00:43 +0000",
    "summary": "Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool.",
    "analysis": {
      "issue": "Share this article: Researchers uncover a watering hole attack likely carried out by APT TA423, which attempts to plant the ScanBox JavaScript-based reconnaissance tool",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Medium",
      "cves": [],
      "threat_categories": [
        "APT"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Tentacles of ‘0ktapus’ Threat Group Victimize 130 Firms",
    "link": "https://threatpost.com/0ktapus-victimize-130-firms/180487/",
    "published": "Mon, 29 Aug 2022 14:56:19 +0000",
    "summary": "Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system.",
    "analysis": {
      "issue": "Share this article: Over 130 companies tangled in sprawling phishing campaign that spoofed a multi-factor authentication system",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Phishing"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Ransomware Attacks are on the Rise",
    "link": "https://threatpost.com/ransomware-attacks-are-on-the-rise/180481/",
    "published": "Fri, 26 Aug 2022 16:44:27 +0000",
    "summary": "Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group.",
    "analysis": {
      "issue": "Share this article: Lockbit is by far this summer’s most prolific ransomware group, trailed by two offshoots of the Conti group",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "High",
      "cves": [],
      "threat_categories": [
        "Ransomware"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Cybercriminals Are Selling Access to Chinese Surveillance Cameras",
    "link": "https://threatpost.com/cybercriminals-are-selling-access-to-chinese-surveillance-cameras/180478/",
    "published": "Thu, 25 Aug 2022 18:47:15 +0000",
    "summary": "Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed.",
    "analysis": {
      "issue": "Share this article: Tens of thousands of cameras have failed to patch a critical, 11-month-old CVE, leaving thousands of organizations exposed",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [
        "CVE-2021-36260"
      ],
      "threat_categories": [
        "Data Breach",
        "Vulnerability",
        "APT"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Twitter Whistleblower Complaint: The TL;DR Version",
    "link": "https://threatpost.com/twitter-whistleblower-tldr-version/180472/",
    "published": "Wed, 24 Aug 2022 14:17:04 +0000",
    "summary": "Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk.",
    "analysis": {
      "issue": "Share this article: Twitter is blasted for security and privacy lapses by the company’s former head of security who alleges the social media giant’s actions amount to a national security risk",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Firewall Bug Under Active Attack Triggers CISA Warning",
    "link": "https://threatpost.com/firewall-bug-under-active-attack-cisa-warning/180467/",
    "published": "Tue, 23 Aug 2022 13:19:58 +0000",
    "summary": "CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP.",
    "analysis": {
      "issue": "Share this article: CISA is warning that Palo Alto Networks’ PAN-OS is under active attack and needs to be patched ASAP",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "High",
      "cves": [
        "CVE-2022-0028"
      ],
      "threat_categories": [
        "Vulnerability"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Fake Reservation Links Prey on Weary Travelers",
    "link": "https://threatpost.com/reservation-links-prey-on-travelers/180462/",
    "published": "Mon, 22 Aug 2022 13:59:06 +0000",
    "summary": "Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels.",
    "analysis": {
      "issue": "Share this article: Fake travel reservations are exacting more pain from the travel weary, already dealing with the misery of canceled flights and overbooked hotels",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [
        "CVE-2017-11882"
      ],
      "threat_categories": [
        "Vulnerability",
        "Malware"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "iPhone Users Urged to Update to Patch 2 Zero-Days",
    "link": "https://threatpost.com/iphone-users-urged-to-update-to-patch-2-zero-days-under-attack/180448/",
    "published": "Fri, 19 Aug 2022 15:25:56 +0000",
    "summary": "Separate fixes to macOS and iOS patch respective flaws in the kernel and WebKit that can allow threat actors to take over devices and are under attack.",
    "analysis": {
      "issue": "Share this article: Separate fixes to macOS and iOS patch respective flaws in the kernel and WebKit that can allow threat actors to take over devices and are under attack",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [
        "CVE-2022-32893",
        "CVE-2022-32894"
      ],
      "threat_categories": [
        "Vulnerability",
        "Supply Chain"
      ]
    }
  },
  {
    "source": "Threat Post",
    "title": "Google Patches Chrome’s Fifth Zero-Day of the Year",
    "link": "https://threatpost.com/google-patches-chromes-fifth-zero-day-of-the-year/180432/",
    "published": "Thu, 18 Aug 2022 14:31:38 +0000",
    "summary": "An insufficient validation input flaw, one of 11 patched in an update this week, could allow for arbitrary code execution and is under active attack.",
    "analysis": {
      "issue": "Share this article: An insufficient validation input flaw, one of 11 patched in an update this week, could allow for arbitrary code execution and is under active attack",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [
        "CVE-2022-2856"
      ],
      "threat_categories": [
        "Vulnerability"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "An AI plush toy exposed thousands of private chats with children",
    "link": "https://www.malwarebytes.com/blog/news/2026/02/an-ai-plush-toy-exposed-thousands-of-private-chats-with-children",
    "published": "Tue, 03 Feb 2026 16:55:51 GMT",
    "summary": "Around 50,000 chat transcripts between children and Bondu’s AI dinosaur plushie were accessible to anyone with a Google account.",
    "analysis": {
      "issue": "Bondu’s AI plush toy exposed a web console that let anyone with a Gmail account read about 50,000 private chats between children and their cuddly toys",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "AT&amp;T breach data resurfaces with new risks for customers",
    "link": "https://www.malwarebytes.com/blog/news/2026/02/att-breach-data-resurfaces-with-new-risks-for-customers",
    "published": "Tue, 03 Feb 2026 11:48:18 GMT",
    "summary": "As leaked datasets are merged and enriched, they become more useful to criminals. That makes recycled breach data a bigger risk for customers.",
    "analysis": {
      "issue": "When data resurfaces, it never comes back weaker",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "High",
      "cves": [],
      "threat_categories": [
        "Phishing"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "Apple’s new iOS setting addresses a hidden layer of location tracking",
    "link": "https://www.malwarebytes.com/blog/mobile/2026/02/apples-new-ios-setting-addresses-a-hidden-layer-of-location-tracking",
    "published": "Tue, 03 Feb 2026 11:20:19 GMT",
    "summary": "Apple has introduced Limit Precise Location, a new setting that reduces how precisely cellular networks can locate your device, though support is currently limited.",
    "analysis": {
      "issue": "Most iPhone owners have hopefully learned to manage app permissions by now, including allowing location access",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "A fake cloud storage alert that ends at Freecash",
    "link": "https://www.malwarebytes.com/blog/news/2026/02/a-fake-cloud-storage-alert-that-ends-at-freecash",
    "published": "Tue, 03 Feb 2026 10:38:35 GMT",
    "summary": "We followed a fake cloud storage payment alert through deceptive affiliate redirects, ending at a familiar destination: Freecash.",
    "analysis": {
      "issue": "Last week we talked about an app that promises users they can make money testing games, or even just by scrolling through TikTok",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "How Manifest v3 forced us to rethink Browser Guard, and why that’s a good thing",
    "link": "https://www.malwarebytes.com/blog/inside-malwarebytes/2026/02/how-manifest-v3-forced-us-to-rethink-browser-guard-and-why-thats-a-good-thing",
    "published": "Mon, 02 Feb 2026 18:11:11 GMT",
    "summary": "Browser Guard still blocks scams and phishing like it always has. But we had to rebuild the way it does that from the ground up.",
    "analysis": {
      "issue": "As a Browser Guard user, you might not have noticed much difference lately",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "High",
      "cves": [],
      "threat_categories": [
        "Phishing"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "Scam-checking just got easier: Malwarebytes is now in ChatGPT",
    "link": "https://www.malwarebytes.com/blog/product/2026/02/scam-checking-just-got-easier-malwarebytes-is-now-in-chatgpt",
    "published": "Mon, 02 Feb 2026 13:45:00 GMT",
    "summary": "Malwarebytes' ChatGPT integration makes it the first cybersecurity provider that can deliver its expertise without ever leaving the chat",
    "analysis": {
      "issue": "If you’ve ever stared at a suspicious text, email, or link and thought “Is this a scam… or am I overthinking it",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Malware"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "How fake party invitations are being used to install remote access tools",
    "link": "https://www.malwarebytes.com/blog/threat-intel/2026/02/how-fake-party-invitations-are-being-used-to-install-remote-access-tools",
    "published": "Mon, 02 Feb 2026 10:18:01 GMT",
    "summary": "Fake party invitations are used to install remote access tools, so the criminals are the ones invited.",
    "analysis": {
      "issue": "”  It sounds friendly, familiar and quite harmless",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "A week in security (January 26 &#8211; February 1)",
    "link": "https://www.malwarebytes.com/blog/news/2026/02/a-week-in-security-january-26-february-1",
    "published": "Mon, 02 Feb 2026 08:02:00 GMT",
    "summary": "A list of topics we covered in the week of January 26 to February 1 of 2026",
    "analysis": {
      "issue": "Last week on Malwarebytes Labs: Stay safe",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Malware"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "Match, Hinge, OkCupid, and Panera Bread breached by ransomware group",
    "link": "https://www.malwarebytes.com/blog/news/2026/01/match-hinge-okcupid-and-panera-bread-breached-by-ransomware-group",
    "published": "Fri, 30 Jan 2026 14:23:28 GMT",
    "summary": "ShinyHunters claims to have stolen millions of records from Match Group dating apps and Panera Bread, with very different consequences for users.",
    "analysis": {
      "issue": "The ShinyHunters ransomware group has claimed the theft of data containing 10 million records belonging to the Match Group and 14 million records from bakery-café chain Panera Bread",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Ransomware",
        "Data Breach"
      ]
    }
  },
  {
    "source": "Malwarebytes",
    "title": "TikTok’s privacy update mentions immigration status. Here’s why.",
    "link": "https://www.malwarebytes.com/blog/news/2026/01/tiktoks-privacy-update-mentions-immigration-status-heres-why",
    "published": "Fri, 30 Jan 2026 11:48:41 GMT",
    "summary": "TikTok updated its privacy policy to mention immigration status, sparking backlash—but the reality is more complicated.",
    "analysis": {
      "issue": "In 2026, could any five words be more chilling than “We’re changing our privacy terms",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "CrowdStrike Named a Customers&rsquo; Choice in 2026 Gartner Peer Insights&trade; Voice of the Customer for Application Security Posture Management Tools",
    "link": "https://www.crowdstrike.com/en-us/blog/crowdstrike-named-customers-choice-2026-gartner-peer-insights-voice-of-the-customer-for-aspm/",
    "published": "Feb 03, 2026 00:00:00-0800",
    "summary": "",
    "analysis": {
      "issue": "CrowdStrike was named a Customers’ Choice in the 2026 Gartner Peer Insights Voice of the Customer for Application Security Posture Management Tools",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "CrowdStrike Falcon Scores Perfect 100% in SE Labs&rsquo; Most Challenging Ransomware Test",
    "link": "https://www.crowdstrike.com/en-us/blog/crowdstrike-falcon-scores-100-percent-in-se-labs-ransomware-test/",
    "published": "Feb 03, 2026 00:00:00-0800",
    "summary": "",
    "analysis": {
      "issue": "The CrowdStrike Falcon scored a perfect 100% detection, protection, and accuracy in SE Labs’ most challenging ransomware test",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Ransomware"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "Secure AI with CrowdStrike: Real-World Stories of Protecting AI Workloads and Data",
    "link": "https://www.crowdstrike.com/en-us/blog/how-three-companies-secure-ai-with-crowdstrike/",
    "published": "Feb 02, 2026 00:00:00-0800",
    "summary": "",
    "analysis": {
      "issue": "Leaders at WEX, Med Center Health, and Genesys share how they're using CrowdStrike to secure AI systems",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "How Agentic Tool Chain Attacks Threaten AI Agent Security",
    "link": "https://www.crowdstrike.com/en-us/blog/how-agentic-tool-chain-attacks-threaten-ai-agent-security/",
    "published": "Jan 30, 2026 00:00:00-0800",
    "summary": "",
    "analysis": {
      "issue": "Learn about three critical agentic tool chain attacks, how they exploit AI agents, and how you can mitigate risk",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Critical",
      "cves": [],
      "threat_categories": [
        "Vulnerability"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "LABYRINTH CHOLLIMA Evolves into Three Adversaries",
    "link": "https://www.crowdstrike.com/en-us/blog/labyrinth-chollima-evolves-into-three-adversaries/",
    "published": "Jan 29, 2026 00:00:00-0800",
    "summary": "",
    "analysis": {
      "issue": "LABYRINTH CHOLLIMA has evolved into three distinct adversaries with specialized malware, objectives, and tradecraft",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "Malware"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "CrowdStrike Named a Customers&rsquo; Choice in 2026 Gartner&reg; Voice of the Customer for Endpoint Protection Platforms",
    "link": "https://www.crowdstrike.com/en-us/blog/crowdstrike-named-customers-choice-2026-gartner-voice-of-the-customer-for-epp-report/",
    "published": "Jan 28, 2026 00:00:00-0800",
    "summary": "",
    "analysis": {
      "issue": "CrowdStrike was named a Customers’ Choice in the 2026 Gartner Voice of the Customer for Endpoint Protection Platforms report",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "Data Protection Day 2026: From Compliance to Resilience",
    "link": "https://www.crowdstrike.com/en-us/blog/data-protection-day-2026-from-compliance-to-resilience/",
    "published": "Jan 28, 2026 00:00:00-0800",
    "summary": "",
    "analysis": {
      "issue": "The AI era is redefining data protection",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "Small Devices, Big Risk: USB Drives Threaten Enterprise Security",
    "link": "https://www.crowdstrike.com/en-us/blog/usb-drives-threaten-enterprise-security/",
    "published": "Jan 21, 2026 00:00:00-0600",
    "summary": "",
    "analysis": {
      "issue": "Learn how CrowdStrike protects data going out, and threats coming in, across removable media like USB drives",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "The Architecture of Agentic Defense: Inside the Falcon Platform",
    "link": "https://www.crowdstrike.com/en-us/blog/architecture-of-agentic-defense-inside-the-falcon-platform/",
    "published": "Jan 16, 2026 00:00:00-0800",
    "summary": "",
    "analysis": {
      "issue": "Learn how CrowdStrike AI and ML technologies work and their role in powering the agentic SOC as agentic defense matures",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  },
  {
    "source": "Crowdstrike Blog",
    "title": "CrowdStrike to Acquire Seraphic to Secure Work in Any Browser",
    "link": "https://www.crowdstrike.com/en-us/blog/crowdstrike-to-acquire-seraphic/",
    "published": "Jan 13, 2026 00:00:00-0600",
    "summary": "",
    "analysis": {
      "issue": "The acquisition of Seraphic will extend zero-trust protections to the browser, facilitating secure access to corporate resources for today’s distributed enterprise",
      "solution": null,
      "cause": null,
      "timeline": null,
      "severity": "Low",
      "cves": [],
      "threat_categories": [
        "General Security"
      ]
    }
  }
]